In [2]:
# imports
import pandas as pd
import numpy as np
from numpy import NaN
from sklearn import preprocessing

In [3]:
# load data
dataFrame = pd.read_csv('data/weather.csv')
dataFrame.head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

# Major Tasks in Data Pre-processing:
1. **Data cleaning:** Fill in missing values, smooth noisy data, identify or remove outliers, and
resolve inconsistencies.

1. **Data integration:** Integration of multiple databases, data cubes, or files.

1. **Data transformation:** Normalization and aggregation.

1. **Data reduction:** Obtains reduced representation in volume but produces the
similar analytical results.

1. **Data discretization:** Part of data reduction but with particular importance, especially for
numerical data.

## 1. Data Cleaning
### Ways to Cleanse Missing Data in Python
To perform a Python data cleansing, you can:

- drop the missing values
- replace them
- fill with scalar value
- fill forward or backward.

### i) Drop Missing Values:
Sometimes csv file has null values, which are later displayed as NaN in Data Frame. Pandas dropna() method allows the user to analyze and drop Rows/Columns with Null values in different ways.

Syntax:
>``` python3
DataFrameName.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
>```

>Parameters:
> - axis: axis takes int or string value for rows/columns. Input can be 0 or 1 for Integer and ‘index’ or ‘columns’ for String.
> - how: how takes string value of two kinds only (‘any’ or ‘all’). ‘any’ drops the row/column if ANY value is Null and ‘all’ drops only if ALL values are null.
> - thresh: thresh takes integer value which tells minimum amount of na values to drop.
> - subset: It’s an array which limits the dropping process to passed rows/columns through list.
> - inplace: It is a boolean which makes the changes in data frame itself if True.

In [4]:
# Before Dropping
dataFrame.head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [5]:
# Drop the missing values
dataFrame.dropna().head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

### ii) Replace:
Pandas dataframe.replace() function is used to replace a string, regex, list, dictionary, series, number etc. from a dataframe. This is a very rich function as it has many variations.
The most powerful thing about this function is that it can work with Python regex (regular expressions).

> Syntax: 

>``` python3
    DataFrame.replace(to_replace=None, value=None, inplace=False, limit=None, regex=False, method=’pad’, axis=None)
>```

>Parameters:
> - to_replace : [str, regex, list, dict, Series, numeric, or None] pattern that we are trying to replace in dataframe.
> - value : Value to use to fill holes (e.g. 0), alternately a dict of values specifying which value to use for each column (columns not in the dict will not be filled). Regular expressions, strings and lists or dicts of such objects are also allowed.
>inplace : If True, in place. Note: this will modify any other views on this object (e.g. a column from a DataFrame). Returns the caller if this is True.
> - limit : Maximum size gap to forward or backward fill
> - regex : Whether to interpret to_replace and/or value as regular expressions. If this is True then to_replace must be a string. Otherwise, to_replace must be None because this parameter will be interpreted as a regular expression or a list, dict, or array of regular expressions.
> - method : Method to use when for replacement, when to_replace is a list.
> -Returns: filled : NDFrame

In [6]:
# before replacing
dataFrame.head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [7]:
# replace NaN
dataFrame.replace({NaN:0}).head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          0.0        9.0   Sunny
2   1/5/2017         28.0        0.0    Snow
3   1/6/2017          0.0        7.0       0
4   1/7/2017         32.0        0.0    Rain
5   1/8/2017          0.0        0.0   Sunny
6   1/9/2017          0.0        0.0       0
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [8]:
# fill witha a scalar value
dataFrame.fillna(8).head()

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          8.0        9.0  Sunny
2  1/5/2017         28.0        8.0   Snow
3  1/6/2017          8.0        7.0      8
4  1/7/2017         32.0        8.0   Rain

### iii) Fill with scalar value:
Sometimes csv file has null values, which are later displayed as NaN in Data Frame. Just like pandas dropna() method manage and remove Null values from a data frame, fillna() manages and let the user replace NaN values with some value of their own.

Syntax:
>``` python3
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs)
>```

Parameters:
> - value : Static, dictionary, array, series or dataframe to fill instead of NaN.
> - method : Method is used if user doesn’t pass any value. Pandas has different methods like bfill, backfill or ffill which fills the place with value in the Forward index or Previous/Back respectively.
> - axis: axis takes int or string value for rows/columns. Input can be 0 or 1 for Integer and ‘index’ or ‘columns’ for String
> - inplace: It is a boolean which makes the changes in data frame itself if True.
> - limit : This is an integer value which specifies maximum number of consequetive forward/backward NaN value fills.
> - downcast : It takes a dict which specifies what dtype to downcast to which one. Like Float64 to int64.
> - \**kwargs : Any other Keyword arguments

In [9]:
# Before Filling
dataFrame.head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

### vi) Filling Forward:

In [10]:
# Before Filling
dataFrame.head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [11]:
# filling forward
dataFrame.fillna(method='pad').head(10)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         32.0        9.0   Sunny
2   1/5/2017         28.0        9.0    Snow
3   1/6/2017         28.0        7.0    Snow
4   1/7/2017         32.0        7.0    Rain
5   1/8/2017         32.0        7.0   Sunny
6   1/9/2017         32.0        7.0   Sunny
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [12]:
# filling backward
dataFrame.fillna(method='bfill').head()

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017         28.0        9.0  Sunny
2  1/5/2017         28.0        7.0   Snow
3  1/6/2017         32.0        7.0   Rain
4  1/7/2017         32.0        8.0   Rain

# 2) Data Intigration
we'll merge the details of students from two datasets, namely student.csv and marks.csv.
The student dataset contains columns such as Age, Gender, Grade, and Employed.

In [13]:
dataFrame1 =  pd.read_csv('data/student.csv')
dataFrame2 =  pd.read_csv('data/mark.csv')
dataFrame2.head(10)

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi
5           6    69  Gwalior
6           7    52   Bhopal
7           8    54  Chennai
8           9    55    Delhi
9          10    94   Mumbai

In [14]:
newDataFrame = pd.merge(dataFrame1, dataFrame2, on='Student_id')

In [15]:
newDataFrame.head(10)

   Student_id  Age  Gender      Grade Employed  Mark     City
0           1   19    Male  1st Class      yes    95  Chennai
1           2   20  Female  2nd Class       no    70    Delhi
2           3   18    Male  1st Class       no    98   Mumbai
3           4   21  Female  2nd Class       no    75     Pune
4           5   19    Male  1st Class       no    89    Kochi
5           6   20    Male  2nd Class      yes    69  Gwalior
6           7   19  Female  3rd Class      yes    52   Bhopal
7           8   21    Male  3rd Class      yes    54  Chennai
8           9   22  Female  3rd Class      yes    55    Delhi
9          10   21    Male  1st Class       no    94   Mumbai

In [16]:
# Normalization
a = np.random.random((1,4))
a *= 20
print('Data',a)
normal = preprocessing.normalize(a)
print('normalized', normal)

Data [[ 4.63672054 19.1297529   1.27867273  1.91478936]]
normalized [[0.23396662 0.96527786 0.06452119 0.09661932]]